# RBS Salary final Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_17-18')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_final_rank_17-18')

In [4]:
rbs

                  NAME  final_rank
0        Melvin Gordon         1.0
1          Kareem Hunt         2.0
2    Leonard Fournette         3.0
3           Dion Lewis         4.0
4        Jordan Howard         5.0
..                 ...         ...
93     Andre Ellington        94.0
94  Deandre Washington        95.0
95   Dwayne Washington        96.0
96        Charles Sims        97.0
97         Terron Ward        98.0

[98 rows x 2 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                   final_rank   salary
NAME
Melvin Gordon             1.0  2667443
Leonard Fournette         3.0  6787711
Dion Lewis                4.0  1300000
Orleans Darkwa            6.0  1100000
Derrick Henry             7.0  1351982

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_final_salary_17-18')